tiborsimon/embedded-tdd-headers/pic/pic18/pic18f27j53_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F27J53_H_
#define _PIC18F27J53_H_

#define ADCTRIG                       0
#define TRIGSEL                       1
#define SRC                           2
#define TRIGSEL0                      3
#define SRC0                          4
#define TRIGSEL1                      5
#define SRC1                          6
#define PMDIS0                        7
#define PMDADC                        8
#define ADCMD                         9
#define SPI1MD                        10
#define PMDMSSP                       11
#define PMDMSSP1                      12
#define SPIMD                         13
#define SPI2MD                        14
#define PMDMSSP2                      15
#define PMDUART                       16
#define PMDUART1                      17
#define UARTMD                        18
#define UART1MD                       19
#define PMDUART2                      20
#define UART2MD                       21
#define PMDECCP                       22
#define ECCP1MD                       23
#define ECCPMD                        24
#define PMDECCP1                      25
#define ECCP2MD                       26
#define PMDECCP2                      27
#define ECCP3MD                       28
#define PMDECCP3                      29
#define PMDIS1                        30
#define PMDTMR                        31
#define TMRMD                         32
#define PMDTMR1                       33
#define TMR1MD                        34
#define PMDTMR2                       35
#define TMR2MD                        36
#define PMDTMR3                       37
#define TMR3MD                        38
#define PMDTMR4                       39
#define TMR4MD                        40
#define PMDRTCC                       41
#define RTCCMD                        42
#define CTMUMD                        43
#define PMDCTMU                       44
#define PMDIS2                        45
#define CMP1MD                        46
#define PMDCMP                        47
#define CMPMD                         48
#define PMDCMP1                       49
#define PMDCMP2                       50
#define CMP2MD                        51
#define CMP3MD                        52
#define PMDCMP3                       53
#define PMDTMR5                       54
#define TMR5MD                        55
#define TMR6MD                        56
#define PMDTMR6                       57
#define PMDTMR8                       58
#define TMR8MD                        59
#define PMDIS3                        60
#define CCP4MD                        61
#define PMDCCP                        62
#define PMDCCP4                       63
#define CCPMD                         64
#define PMDCCP5                       65
#define CCP5MD                        66
#define CCP6MD                        67
#define PMDCCP6                       68
#define CCP7MD                        69
#define PMDCCP7                       70
#define CCP8MD                        71
#define PMDCCP8                       72
#define PMDCCP9                       73
#define CCP9MD                        74
#define PMDCCP10                      75
#define CCP10MD                       76
#define PPSCON                        77
#define IOLOCK                        78
#define CCP10CON                      79
#define CCP10M                        80
#define CCP10M0                       81
#define CCP10M1                       82
#define CCP10M2                       83
#define CCP10M3                       84
#define DC10B0                        85
#define DC10B                         86
#define DC10B1                        87
#define CCPR10L                       88
#define CCPR10H                       89
#define CCP9CON                       90
#define CCP9M0                        91
#define CCP9M                         92
#define CCP9M1                        93
#define CCP9M2                        94
#define CCP9M3                        95
#define DC9B0                         96
#define DC9B                          97
#define DC9B1                         98
#define CCPR9L                        99
#define CCPR9H                        100
#define CCP8CON                       101
#define CCP8M0                        102
#define CCP8M                         103
#define CCP8M1                        104
#define CCP8M2                        105
#define CCP8M3                        106
#define DC8B0                         107
#define DC8B                          108
#define DC8B1                         109
#define CCPR8L                        110
#define CCPR8H                        111
#define CCP7CON                       112
#define CCP7M0                        113
#define CCP7M                         114
#define CCP7M1                        115
#define CCP7M2                        116
#define CCP7M3                        117
#define DC7B                          118
#define DC7B0                         119
#define DC7B1                         120
#define CCPR7L                        121
#define CCPR7H                        122
#define CCP6CON                       123
#define CCP6M                         124
#define CCP6M0                        125
#define CCP6M1                        126
#define CCP6M2                        127
#define CCP6M3                        128
#define DC6B0                         129
#define DC6B                          130
#define DC6B1                         131
#define CCPR6L                        132
#define CCPR6H                        133
#define CCP5CON                       134
#define CCP5M0                        135
#define CCP5M                         136
#define CCP5M1                        137
#define CCP5M2                        138
#define CCP5M3                        139
#define DC5B0                         140
#define DC5B                          141
#define DC5B1                         142
#define CCPR5L                        143
#define CCPR5H                        144
#define CCP4CON                       145
#define CCP4M                         146
#define CCP4M0                        147
#define CCP4M1                        148
#define CCP4M2                        149
#define CCP4M3                        150
#define DC4B0                         151
#define DC4B                          152
#define DC4B1                         153
#define CCPR4L                        154
#define CCPR4H                        155
#define CCP3CON                       156
#define CCP3M                         157
#define CCP3M0                        158
#define CCP3M1                        159
#define CCP3M2                        160
#define CCP3M3                        161
#define DC3B                          162
#define DC3B0                         163
#define DC3B1                         164
#define P3M                           165
#define P3M0                          166
#define P3M1                          167
#define CCPR3L                        168
#define CCPR3H                        169
#define ECCP3DEL                      170
#define P3DC                          171
#define P3DC0                         172
#define P3DC1                         173
#define P3DC2                         174
#define P3DC3                         175
#define P3DC4                         176
#define P3DC5                         177
#define P3DC6                         178
#define P3RSEN                        179
#define PSS3BD0                       180
#define PSS3BD                        181
#define PSS3BD1                       182
#define PSS3AC0                       183
#define PSS3AC                        184
#define PSS3AC1                       185
#define ECCP3AS                       186
#define ECCP3AS0                      187
#define ECCP3AS1                      188
#define ECCP3AS2                      189
#define ECCP3ASE                      190
#define PSTR3CON                      191
#define PSTR3CON_STRA                 192
#define STRA3                         193
#define STRB3                         194
#define PSTR3CON_STRB                 195
#define PSTR3CON_STRC                 196
#define STRC3                         197
#define STRD3                         198
#define PSTR3CON_STRD                 199
#define STRSYNC3                      200
#define PSTR3CON_STRSYNC              201
#define CMPL                          202
#define PSTR3CON_CMPL0                203
#define CMPL03                        204
#define CMPL13                        205
#define PSTR3CON_CMPL1                206
#define T8CON                         207
#define T8CKPS0                       208
#define T8CKPS                        209
#define T8CKPS1                       210
#define TMR8ON                        211
#define T8OUTPS                       212
#define T8OUTPS0                      213
#define T8OUTPS1                      214
#define T8OUTPS2                      215
#define T8OUTPS3                      216
#define PR8                           217
#define TMR8                          218
#define T6CON                         219
#define T6CKPS0                       220
#define T6CKPS                        221
#define T6CKPS1                       222
#define TMR6ON                        223
#define T6OUTPS0                      224
#define T6OUTPS                       225
#define T6OUTPS1                      226
#define T6OUTPS2                      227
#define T6OUTPS3                      228
#define PR6                           229
#define TMR6                          230
#define T5GCON                        231
#define T5GSS                         232
#define T5GSS0                        233
#define T5GSS1                        234
#define T5GVAL                        235
#define T5DONE                        236
#define T5GGO_NOT_T5DONE              237
#define nT5DONE                       238
#define T5GGO_nT5DONE                 239
#define NOT_T5DONE                    240
#define T5GGO                         241
#define T5GSPM                        242
#define T5GTM                         243
#define T5GPOL                        244
#define TMR5GE                        245
#define T5CON                         246
#define TMR5ON                        247
#define T5CON_RD16                    248
#define RD165                         249
#define nT5SYNC                       250
#define NOT_T5SYNC                    251
#define SOSCEN5                       252
#define T5OSCEN                       253
#define T5CKPS                        254
#define T5CKPS0                       255
#define T5CKPS1                       256
#define TMR5CS0                       257
#define TMR5CS                        258
#define TMR5CS1                       259
#define TMR5L                         260
#define TMR5H                         261
#define CM3CON                        262
#define CM3CON_CCH                    263
#define CCH03                         264
#define CM3CON_CCH0                   265
#define CCH13                         266
#define CM3CON_CCH1                   267
#define CM3CON_CREF                   268
#define CREF3                         269
#define CM3CON_EVPOL                  270
#define EVPOL03                       271
#define CM3CON_EVPOL0                 272
#define CM3CON_EVPOL1                 273
#define EVPOL13                       274
#define CM3CON_CPOL                   275
#define CPOL3                         276
#define COE3                          277
#define CM3CON_COE                    278
#define CM3CON_CON                    279
#define CON3                          280
#define UEP0                          281
#define UEP0_EPSTALL                  282
#define EP0STALL                      283
#define EPSTALL0                      284
#define UEP0_EPINEN                   285
#define EPINEN0                       286
#define EP0INEN                       287
#define UEP0_EPOUTEN                  288
#define EP0OUTEN                      289
#define EPOUTEN0                      290
#define EPCONDIS0                     291
#define EP0CONDIS                     292
#define UEP0_EPCONDIS                 293
#define UEP0_EPHSHK                   294
#define EP0HSHK                       295
#define EPHSHK0                       296
#define UEP1                          297
#define EPSTALL1                      298
#define EP1STALL                      299
#define UEP1_EPSTALL                  300
#define EPINEN1                       301
#define EP1INEN                       302
#define UEP1_EPINEN                   303
#define EPOUTEN1                      304
#define UEP1_EPOUTEN                  305
#define EP1OUTEN                      306
#define UEP1_EPCONDIS                 307
#define EP1CONDIS                     308
#define EPCONDIS1                     309
#define EPHSHK1                       310
#define EP1HSHK                       311
#define UEP1_EPHSHK                   312
#define UEP2                          313
#define EP2STALL                      314
#define EPSTALL2                      315
#define UEP2_EPSTALL                  316
#define EP2INEN                       317
#define EPINEN2                       318
#define UEP2_EPINEN                   319
#define EP2OUTEN                      320
#define UEP2_EPOUTEN                  321
#define EPOUTEN2                      322
#define EP2CONDIS                     323
#define UEP2_EPCONDIS                 324
#define EPCONDIS2                     325
#define EP2HSHK                       326
#define EPHSHK2                       327
#define UEP2_EPHSHK                   328
#define UEP3                          329
#define UEP3_EPSTALL                  330
#define EPSTALL3                      331
#define EP3STALL                      332
#define UEP3_EPINEN                   333
#define EPINEN3                       334
#define EP3INEN                       335
#define EP3OUTEN                      336
#define EPOUTEN3                      337
#define UEP3_EPOUTEN                  338
#define UEP3_EPCONDIS                 339
#define EP3CONDIS                     340
#define EPCONDIS3                     341
#define EPHSHK3                       342
#define UEP3_EPHSHK                   343
#define EP3HSHK                       344
#define UEP4                          345
#define EP4STALL                      346
#define EPSTALL4                      347
#define UEP4_EPSTALL                  348
#define UEP4_EPINEN                   349
#define EP4INEN                       350
#define EPINEN4                       351
#define UEP4_EPOUTEN                  352
#define EPOUTEN4                      353
#define EP4OUTEN                      354
#define EPCONDIS4                     355
#define EP4CONDIS                     356
#define UEP4_EPCONDIS                 357
#define EPHSHK4                       358
#define EP4HSHK                       359
#define UEP4_EPHSHK                   360
#define UEP5                          361
#define EP5STALL                      362
#define UEP5_EPSTALL                  363
#define EPSTALL5                      364
#define EPINEN5                       365
#define UEP5_EPINEN                   366
#define EP5INEN                       367
#define EPOUTEN5                      368
#define UEP5_EPOUTEN                  369
#define EP5OUTEN                      370
#define EPCONDIS5                     371
#define EP5CONDIS                     372
#define UEP5_EPCONDIS                 373
#define UEP5_EPHSHK                   374
#define EPHSHK5                       375
#define EP5HSHK                       376
#define UEP6                          377
#define EPSTALL6                      378
#define UEP6_EPSTALL                  379
#define EP6STALL                      380
#define EP6INEN                       381
#define UEP6_EPINEN                   382
#define EPINEN6                       383
#define EP6OUTEN                      384
#define EPOUTEN6                      385
#define UEP6_EPOUTEN                  386
#define UEP6_EPCONDIS                 387
#define EP6CONDIS                     388
#define EPCONDIS6                     389
#define EPHSHK6                       390
#define UEP6_EPHSHK                   391
#define EP6HSHK                       392
#define UEP7                          393
#define UEP7_EPSTALL                  394
#define EP7STALL                      395
#define EPSTALL7                      396
#define EP7INEN                       397
#define EPINEN7                       398
#define UEP7_EPINEN                   399
#define EP7OUTEN                      400
#define UEP7_EPOUTEN                  401
#define EPOUTEN7                      402
#define UEP7_EPCONDIS                 403
#define EP7CONDIS                     404
#define EPCONDIS7                     405
#define EPHSHK7                       406
#define UEP7_EPHSHK                   407
#define EP7HSHK                       408
#define UEP8                          409
#define EPSTALL8                      410
#define UEP8_EPSTALL                  411
#define UEP8_EPINEN                   412
#define EPINEN8                       413
#define UEP8_EPOUTEN                  414
#define EPOUTEN8                      415
#define UEP8_EPCONDIS                 416
#define EPCONDIS8                     417
#define UEP8_EPHSHK                   418
#define EPHSHK8                       419
#define UEP9                          420
#define EPSTALL9                      421
#define UEP9_EPSTALL                  422
#define EPINEN9                       423
#define UEP9_EPINEN                   424
#define UEP9_EPOUTEN                  425
#define EPOUTEN9                      426
#define UEP9_EPCONDIS                 427
#define EPCONDIS9                     428
#define UEP9_EPHSHK                   429
#define EPHSHK9                       430
#define UEP10                         431
#define EPSTALL10                     432
#define UEP10_EPSTALL                 433
#define EPINEN10                      434
#define UEP10_EPINEN                  435
#define UEP10_EPOUTEN                 436
#define EPOUTEN10                     437
#define EPCONDIS10                    438
#define UEP10_EPCONDIS                439
#define UEP10_EPHSHK                  440
#define EPHSHK10                      441
#define UEP11                         442
#define UEP11_EPSTALL                 443
#define EPSTALL11                     444
#define EPINEN11                      445
#define UEP11_EPINEN                  446
#define UEP11_EPOUTEN                 447
#define EPOUTEN11                     448
#define EPCONDIS11                    449
#define UEP11_EPCONDIS                450
#define UEP11_EPHSHK                  451
#define EPHSHK11                      452
#define UEP12                         453
#define EPSTALL12                     454
#define UEP12_EPSTALL                 455
#define UEP12_EPINEN                  456
#define EPINEN12                      457
#define EPOUTEN12                     458
#define UEP12_EPOUTEN                 459
#define EPCONDIS12                    460
#define UEP12_EPCONDIS                461
#define EPHSHK12                      462
#define UEP12_EPHSHK                  463
#define UEP13                         464
#define UEP13_EPSTALL                 465
#define EPSTALL13                     466
#define EPINEN13                      467
#define UEP13_EPINEN                  468
#define UEP13_EPOUTEN                 469
#define EPOUTEN13                     470
#define EPCONDIS13                    471
#define UEP13_EPCONDIS                472
#define EPHSHK13                      473
#define UEP13_EPHSHK                  474
#define UEP14                         475
#define UEP14_EPSTALL                 476
#define EPSTALL14                     477
#define EPINEN14                      478
#define UEP14_EPINEN                  479
#define UEP14_EPOUTEN                 480
#define EPOUTEN14                     481
#define EPCONDIS14                    482
#define UEP14_EPCONDIS                483
#define UEP14_EPHSHK                  484
#define EPHSHK14                      485
#define UEP15                         486
#define UEP15_EPSTALL                 487
#define EPSTALL15                     488
#define UEP15_EPINEN                  489
#define EPINEN15                      490
#define UEP15_EPOUTEN                 491
#define EPOUTEN15                     492
#define EPCONDIS15                    493
#define UEP15_EPCONDIS                494
#define UEP15_EPHSHK                  495
#define EPHSHK15                      496
#define UIE                           497
#define URSTIE                        498
#define UERRIE                        499
#define ACTVIE                        500
#define TRNIE                         501
#define IDLEIE                        502
#define STALLIE                       503
#define SOFIE                         504
#define UEIE                          505
#define PIDEE                         506
#define CRC5EE                        507
#define CRC16EE                       508
#define DFN8EE                        509
#define BTOEE                         510
#define BTSEE                         511
#define UADDR                         512
#define ADDR                          513
#define ADDR0                         514
#define ADDR1                         515
#define ADDR2                         516
#define ADDR3                         517
#define ADDR4                         518
#define ADDR5                         519
#define ADDR6                         520
#define UCFG                          521
