tiborsimon/embedded-tdd-headers/pic/pic18/pic18f27j53_tdd.h
#define LB0                           1091
#define LATB0                         1092
#define LB1                           1093
#define LATB1                         1094
#define LB2                           1095
#define LATB2                         1096
#define LB3                           1097
#define LATB3                         1098
#define LB4                           1099
#define LATB4                         1100
#define LB5                           1101
#define LATB5                         1102
#define LB6                           1103
#define LATB6                         1104
#define LB7                           1105
#define LATB7                         1106
#define LATC                          1107
#define LATC0                         1108
#define LC0                           1109
#define LATC1                         1110
#define LC1                           1111
#define LATC2                         1112
#define LC2                           1113
#define LC6                           1114
#define LATC6                         1115
#define LATC7                         1116
#define LC7                           1117
#define PIE4                          1118
#define CCP3IE                        1119
#define CCP4IE                        1120
#define CCP5IE                        1121
#define CCP6IE                        1122
#define CCP7IE                        1123
#define CCP8IE                        1124
#define CCP9IE                        1125
#define CCP10IE                       1126
#define PIR4                          1127
#define CCP3IF                        1128
#define CCP4IF                        1129
#define CCP5IF                        1130
#define CCP6IF                        1131
#define CCP7IF                        1132
#define CCP8IF                        1133
#define CCP9IF                        1134
#define CCP10IF                       1135
#define IPR4                          1136
#define CCP3IP                        1137
#define CCIP3IP                       1138
#define CCP4IP                        1139
#define CCP5IP                        1140
#define CCP6IP                        1141
#define CCP7IP                        1142
#define CCP8IP                        1143
#define CCP9IP                        1144
#define CCP10IP                       1145
#define PIE5                          1146
#define TMR1GIE                       1147
#define TMR5GIE                       1148
#define TMR5IE                        1149
#define TMR6IE                        1150
#define TMR8IE                        1151
#define CM3IE                         1152
#define TRISA                         1153
#define TRISA0                        1154
#define TRISA1                        1155
#define TRISA2                        1156
#define TRISA3                        1157
#define TRISA5                        1158
#define TRISA6                        1159
#define TRISA7                        1160
#define TRISB                         1161
#define TRISB0                        1162
#define TRISB1                        1163
#define TRISB2                        1164
#define TRISB3                        1165
#define TRISB4                        1166
#define TRISB5                        1167
#define TRISB6                        1168
#define TRISB7                        1169
#define TRISC                         1170
#define TRISC0                        1171
#define TRISC1                        1172
#define TRISC2                        1173
#define TRISC6                        1174
#define TRISC7                        1175
#define T3GCON                        1176
#define T3GSS0                        1177
#define T3GSS1                        1178
#define T3GVAL                        1179
#define T3GGO                         1180
#define T3GGO_T3DONE                  1181
#define NOT_T3DONE                    1182
#define nT3DONE                       1183
#define T3GSPM                        1184
#define T3GTM                         1185
#define T3GPOL                        1186
#define TMR3GE                        1187
#define PIR5                          1188
#define TMR1GIF                       1189
#define TMR5GIF                       1190
#define TMR5IF                        1191
#define TMR6IF                        1192
#define TMR8IF                        1193
#define CM3IF                         1194
#define IPR5                          1195
#define CCH05                         1196
#define TMR1GIP                       1197
#define TMR5GIP                       1198
#define CCH15                         1199
#define TMR5IP                        1200
#define EVPOL05                       1201
#define TMR6IP                        1202
#define EVPOL15                       1203
#define TMR8IP                        1204
#define CM3IP                         1205
#define T1GCON                        1206
#define T1GSS0                        1207
#define T1GSS1                        1208
#define T1GVAL                        1209
#define T1GGO_nT1DONE                 1210
#define T1DONE                        1211
#define nT1DONE                       1212
#define T1GGO_NOT_T1DONE              1213
#define NOT_T1DONE                    1214
#define T1GGO                         1215
#define T1GSPM                        1216
#define T1GTM                         1217
#define T1GPOL                        1218
#define TMR1GE                        1219
#define OSCTUNE                       1220
#define TUN0                          1221
#define TUN                           1222
#define TUN1                          1223
#define TUN2                          1224
#define TUN3                          1225
#define TUN4                          1226
#define TUN5                          1227
#define PLLEN                         1228
#define INTSRC                        1229
#define RCSTA2                        1230
#define RCD82                         1231
#define RX9D2                         1232
#define RCSTA2_RX9D                   1233
#define OERR2                         1234
#define RCSTA2_OERR                   1235
#define FERR2                         1236
#define RCSTA2_FERR                   1237
#define ADDEN2                        1238
#define RCSTA2_ADDEN                  1239
#define RCSTA2_CREN                   1240
#define CREN2                         1241
#define SREN2                         1242
#define RCSTA2_SREN                   1243
#define RC92                          1244
#define RC8_92                        1245
#define RCSTA2_RX9                    1246
#define RX92                          1247
#define RCSTA2_SPEN                   1248
#define SPEN2                         1249
#define PIE1                          1250
#define TMR1IE                        1251
#define TMR2IE                        1252
#define CCP1IE                        1253
#define SSP1IE                        1254
#define SSPIE                         1255
#define TXIE                          1256
#define TX1IE                         1257
#define RC1IE                         1258
#define RCIE                          1259
#define ADIE                          1260
#define PIR1                          1261
#define TMR1IF                        1262
#define TMR2IF                        1263
#define CCP1IF                        1264
#define SSPIF                         1265
#define SSP1IF                        1266
#define TXIF                          1267
#define TX1IF                         1268
#define RCIF                          1269
#define RC1IF                         1270
#define ADIF                          1271
#define IPR1                          1272
#define TMR1IP                        1273
#define TMR2IP                        1274
#define CCP1IP                        1275
#define SSPIP                         1276
#define SSP1IP                        1277
#define TX1IP                         1278
#define TXIP                          1279
#define RCIP                          1280
#define RC1IP                         1281
#define ADIP                          1282
#define PIE2                          1283
#define CCP2IE                        1284
#define TMR3IE                        1285
#define HLVDIE                        1286
#define LVDIE                         1287
#define BCL1IE                        1288
#define BCLIE                         1289
#define USBIE                         1290
#define CM1IE                         1291
#define CMIE                          1292
#define CM2IE                         1293
#define OSCFIE                        1294
#define PIR2                          1295
#define CCP2IF                        1296
#define TMR3IF                        1297
#define HLVDIF                        1298
#define LVDIF                         1299
#define BCL1IF                        1300
#define BCLIF                         1301
#define USBIF                         1302
#define CM1IF                         1303
#define CMIF                          1304
#define CM2IF                         1305
#define OSCFIF                        1306
#define IPR2                          1307
#define CCP2IP                        1308
#define TMR3IP                        1309
#define HLVDIP                        1310
#define LVDIP                         1311
#define BCLIP                         1312
#define BCL1IP                        1313
#define USBIP                         1314
#define CM1IP                         1315
#define CM2IP                         1316
#define CMIP                          1317
#define OSCFIP                        1318
#define PIE3                          1319
#define RTCCIE                        1320
#define RXB0IE                        1321
#define RXBNIE                        1322
#define TMR3GIE                       1323
#define RXB1IE                        1324
#define CTMUIE                        1325
#define TXB0IE                        1326
#define TMR4IE                        1327
#define TXB1IE                        1328
#define TXB2IE                        1329
#define TXBNIE                        1330
#define TX2IE                         1331
#define RC2IE                         1332
#define BCL2IE                        1333
#define SSP2IE                        1334
#define PIR3                          1335
#define RTCCIF                        1336
#define RXBNIF                        1337
#define TMR3GIF                       1338
#define CTMUIF                        1339
#define TMR4IF                        1340
#define TXBNIF                        1341
#define TX2IF                         1342
#define RC2IF                         1343
#define BCL2IF                        1344
#define SSP2IF                        1345
#define IPR3                          1346
#define RTCCIP                        1347
#define TMR3GIP                       1348
#define RXBNIP                        1349
#define CTMUIP                        1350
#define TMR4IP                        1351
#define TX2IP                         1352
#define TXBNIP                        1353
#define RC2IP                         1354
#define BCL2IP                        1355
#define SSP2IP                        1356
#define EECON1                        1357
#define WR                            1358
#define WREN                          1359
#define WRERR                         1360
#define FREE                          1361
#define WPROG                         1362
#define EECON2                        1363
#define TXSTA2                        1364
#define TX9D2                         1365
#define TXSTA2_TX9D                   1366
#define TXD82                         1367
#define TRMT2                         1368
#define TXSTA2_TRMT                   1369
#define BRGH2                         1370
#define TXSTA2_BRGH                   1371
#define SENDB2                        1372
#define TXSTA2_SENDB                  1373
#define TXSTA2_SYNC                   1374
#define SYNC2                         1375
#define TXEN2                         1376
#define TXSTA2_TXEN                   1377
#define TX8_92                        1378
#define TX92                          1379
#define TXSTA2_TX9                    1380
#define TXSTA2_CSRC                   1381
#define CSRC2                         1382
#define TXREG2                        1383
#define RCREG2                        1384
#define SPBRG2                        1385
#define RCSTA1                        1386
#define RCSTA1_RX9D                   1387
#define RX9D1                         1388
#define RCD8                          1389
#define RCSTA1_OERR                   1390
#define OERR1                         1391
#define RCSTA1_FERR                   1392
#define FERR1                         1393
#define RCSTA1_ADDEN                  1394
#define ADDEN1                        1395
#define ADEN                          1396
#define RCSTA1_CREN                   1397
#define CREN1                         1398
#define SRENA                         1399
#define SREN1                         1400
#define RCSTA1_SREN                   1401
#define RC8_9                         1402
#define RCSTA1_RX9                    1403
#define nRC8                          1404
#define NOT_RC8                       1405
#define RC9                           1406
#define RX91                          1407
#define RCSTA1_SPEN                   1408
#define SPEN1                         1409
#define TXSTA1                        1410
#define TX9D1                         1411
#define TXSTA1_TX9D                   1412
#define TXD8                          1413
#define TRMT1                         1414
#define TXSTA1_TRMT                   1415
#define BRGH1                         1416
#define TXSTA1_BRGH                   1417
#define TXSTA1_SENDB                  1418
#define SENDB1                        1419
#define TXSTA1_SYNC                   1420
#define SYNC1                         1421
#define TXEN1                         1422
#define TXSTA1_TXEN                   1423
#define TX91                          1424
#define TX8_9                         1425
#define NOT_TX8                       1426
#define nTX8                          1427
#define TXSTA1_TX9                    1428
#define TXSTA1_CSRC                   1429
#define CSRC1                         1430
#define TXREG1                        1431
#define RCREG1                        1432
#define SPBRG1                        1433
#define CTMUICON                      1434
#define IRNG                          1435
#define IRNG0                         1436
#define IRNG1                         1437
#define ITRIM0                        1438
#define ITRIM                         1439
#define ITRIM1                        1440
#define ITRIM2                        1441
#define ITRIM3                        1442
#define ITRIM4                        1443
#define ITRIM5                        1444
#define CTMUCONL                      1445
#define EDG1STAT                      1446
#define EDG2STAT                      1447
#define EDG1SEL0                      1448
#define EDG1SEL1                      1449
#define EDG1POL                       1450
#define EDG2SEL0                      1451
#define EDG2SEL1                      1452
#define EDG2POL                       1453
#define CTMUCONH                      1454
#define CTTRIG                        1455
#define IDISSEN                       1456
#define EDGSEQEN                      1457
#define EDGEN                         1458
#define TGEN                          1459
#define CTMUSIDL                      1460
#define CTMUEN                        1461
#define CCP2CON                       1462
#define CCP2M                         1463
#define CCP2M0                        1464
#define CCP2M1                        1465
#define CCP2M2                        1466
#define CCP2M3                        1467
#define DC2B                          1468
#define DC2B0                         1469
#define CCP2Y                         1470
#define DC2B1                         1471
#define CCP2X                         1472
#define P2M                           1473
#define P2M0                          1474
#define P2M1                          1475
#define CCPR2L                        1476
#define CCPR2H                        1477
#define ECCP2DEL                      1478
#define ECCP2DEL_P2DC0                1479
#define P2DC                          1480
#define ECCP2DEL_P2DC1                1481
#define ECCP2DEL_P2DC2                1482
#define ECCP2DEL_P2DC3                1483
#define ECCP2DEL_P2DC4                1484
#define ECCP2DEL_P2DC5                1485
#define ECCP2DEL_P2DC6                1486
#define P2RSEN                        1487
#define PSS2BD                        1488
#define PSS2BD0                       1489
#define PSS2BD1                       1490
#define PSS2AC0                       1491
#define PSS2AC                        1492
#define PSS2AC1                       1493
#define ECCP2AS0                      1494
#define ECCP2AS                       1495
#define ECCP2AS1                      1496
#define ECCP2AS2                      1497
#define ECCP2ASE                      1498
#define PSTR2CON                      1499
#define PSTR2CON_STRA                 1500
#define P2DC02                        1501
#define STRA2                         1502
#define P2DC0CON                      1503
#define PSTR2CON_P2DC0                1504
#define STRB2                         1505
#define P2DC12                        1506
#define PSTR2CON_STRB                 1507
#define PSTR2CON_P2DC1                1508
#define P2DC1CON                      1509
#define PSTR2CON_STRC                 1510
#define STRC2                         1511
#define PSTR2CON_P2DC2                1512
#define P2DC22                        1513
#define P2DC2CON                      1514
#define P2DC32                        1515
#define STRD2                         1516
#define PSTR2CON_STRD                 1517
#define P2DC3CON                      1518
#define PSTR2CON_P2DC3                1519
#define P2DC4CON                      1520
#define STRSYNC2                      1521
#define PSTR2CON_STRSYNC              1522
#define PSTR2CON_P2DC4                1523
#define P2DC42                        1524
#define P2DC52                        1525
#define P2DC5CON                      1526
#define PSTR2CON_P2DC5                1527
#define P2DC6CON                      1528
#define CMPL02                        1529
#define PSTR2CON_P2DC6                1530
#define P2DC62                        1531
#define PSTR2CON_CMPL0                1532
#define CMPL12                        1533
#define PSTR2CON_CMPL1                1534
#define CCP1CON                       1535
#define CCP1M0                        1536
#define CCP1M                         1537
#define CCP1M1                        1538
#define CCP1M2                        1539
#define CCP1M3                        1540
#define CCP1Y                         1541
#define DC1B                          1542
#define DC1B0                         1543
#define CCP1X                         1544
#define DC1B1                         1545
#define P1M                           1546
#define P1M0                          1547
#define P1M1                          1548
#define CCPR1L                        1549
#define CCPR1H                        1550
#define ECCP1DEL                      1551
#define P1DC                          1552
#define P1DC0                         1553
#define P1DC1                         1554
#define P1DC2                         1555
#define P1DC3                         1556
#define P1DC4                         1557
#define P1DC5                         1558
#define P1DC6                         1559
#define P1RSEN                        1560
#define PSS1BD0                       1561
#define PSS1BD                        1562
#define PSS1BD1                       1563
#define PSS1AC                        1564
#define PSS1AC0                       1565
#define PSS1AC1                       1566
#define ECCP1AS                       1567
#define ECCP1AS0                      1568
#define ECCP1AS1                      1569
#define ECCP1AS2                      1570
#define ECCP1ASE                      1571
#define PSTR1CON                      1572
#define PSTR1CON_STRA                 1573
#define PSTR1CON_STRB                 1574
#define PSTR1CON_STRC                 1575
#define PSTR1CON_STRD                 1576
#define PSTR1CON_STRSYNC              1577
#define PSTR1CON_CMPL0                1578
#define PSTR1CON_CMPL1                1579
#define WDTCON                        1580
#define SWDTEN                        1581
#define SWDTE                         1582
#define ULPSINK                       1583
#define ULPEN                         1584
#define DS                            1585
#define VBGOE                         1586
#define ULPLVL                        1587
#define LVDSTAT                       1588
#define REGSLP                        1589
#define ADCON1                        1590
#define ADCS0                         1591
#define ADCS                          1592
#define ADCS1                         1593
#define ADCS2                         1594
#define ACQT0                         1595
#define ACQT                          1596
#define CHSN3                         1597
#define ACQT1                         1598
#define VCFG01                        1599
#define ACQT2                         1600
#define VCFG11                        1601
#define ADCON1_ADCAL                  1602
#define ADFM                          1603
#define ADCON0                        1604
#define ADON                          1605
#define nDONE                         1606
#define GO_nDONE                      1607
#define NOT_DONE                      1608
#define GODONE                        1609
#define GO_DONE                       1610
#define DONE                          1611
#define GO                            1612
#define GO_NOT_DONE                   1613
#define CHS                           1614
#define CHS0                          1615
#define CHS1                          1616
#define CHS2                          1617
#define CHS3                          1618
#define VCFG                          1619
#define VCFG0                         1620
#define VCFG1                         1621
#define ADCON0_ADCAL                  1622
#define ADRESL                        1623
#define ADRESH                        1624
#define SSP1CON2                      1625
#define SEN1                          1626
#define SSP1CON2_SEN                  1627
#define ADMSK11                       1628
#define SSP1CON2_RSEN                 1629
#define RSEN1                         1630
#define SSP1CON2_ADMSK1               1631
#define SSP1CON2_PEN                  1632
#define ADMSK21                       1633
#define PEN1                          1634
#define SSP1CON2_ADMSK2               1635
#define ADMSK31                       1636
#define RCEN1                         1637
#define SSP1CON2_RCEN                 1638
#define SSP1CON2_ADMSK3               1639
#define SSP1CON2_ACKEN                1640
#define ACKEN1                        1641
#define ADMSK41                       1642
#define SSP1CON2_ADMSK4               1643
#define ACKDT1                        1644
#define ADMSK51                       1645
#define SSP1CON2_ACKDT                1646
#define SSP1CON2_ADMSK5               1647
#define SSP1CON2_ACKSTAT              1648
